In [8]:
import pandas as pd
import numpy as np
# se crea un diccionario simple
datos = {"nombre": ["Kevin", "Daniela", "Alexa", "Camilo","Cesar"], 
        "Calificaciones": ["100", "100", "50", "90", "80"],
        "Deportes": ["Furbol", "Natacion","Ciclismo", "basebol","Futsal"],
        "Materias": ["Calculo", "Fisica", "Cocina","Quimica", "Filosofia"]}
#se convierte el un DataFrame de pandas
df = pd.DataFrame(datos)

In [11]:
#Datos no válidos
datos_no_validos = {"nombre": ["Kevin", "Daniela", "N/A", "Camilo","Cesar"], 
        "Calificaciones": ["100", np.nan, "50", "90", "80"],
        "Deportes": ["Furbol", "Natacion","N/A", "basebol","Futsal"],
        "Materias": ["Calculo", "Fisica", "N/A","Quimica", "Filosofia"]}
df_no_valido = pd.DataFrame(datos_no_validos)

In [12]:
# ver toda la información del DataFrame
df_no_valido.info

<bound method DataFrame.info of     nombre Calificaciones  Deportes   Materias
0    Kevin            100    Furbol    Calculo
1  Daniela            NaN  Natacion     Fisica
2      N/A             50       N/A        N/A
3   Camilo             90   basebol    Quimica
4    Cesar             80    Futsal  Filosofia>

In [14]:
#Estadisticas básicas 
df_no_valido.describe()
#buscar y reemplazar 

df_no_valido = df_no_valido.replace(np.nan, "0")
df_no_valido

    nombre Calificaciones  Deportes   Materias
0    Kevin            100    Furbol    Calculo
1  Daniela              0  Natacion     Fisica
2      N/A             50       N/A        N/A
3   Camilo             90   basebol    Quimica
4    Cesar             80    Futsal  Filosofia

In [16]:
#Eliminar un dato de una columna en especifico 
columna = df_no_valido[ df_no_valido["nombre"] != "N/A"]
columna

    nombre Calificaciones  Deportes   Materias
0    Kevin            100    Furbol    Calculo
1  Daniela              0  Natacion     Fisica
3   Camilo             90   basebol    Quimica
4    Cesar             80    Futsal  Filosofia